In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT count(DISTINCT f.songplay_id) as songs_listened, u.first_name, u.last_name FROM ft_songplays f JOIN dim_users u ON u.user_id = f.user_id GROUP BY 2, 3 ORDER BY 1 DESC LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[(689, 'Chloe', 'Cuevas'),
 (665, 'Tegan', 'Levine'),
 (557, 'Kate', 'Harrell'),
 (463, 'Lily', 'Koch'),
 (397, 'Aleena', 'Kirby'),
 (346, 'Jacqueline', 'Lynch'),
 (321, 'Layla', 'Griffin'),
 (289, 'Jacob', 'Klein'),
 (270, 'Mohammad', 'Rodriguez'),
 (248, 'Matthew', 'Jones')]

In [4]:
%sql SELECT count(*) as artists_registered, location as Location FROM dim_artists WHERE location <> '' GROUP BY 2 ORDER BY 1 DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(2, 'California - SF'),
 (2, 'London, England'),
 (1, 'Orlando, FL'),
 (1, 'Brandon'),
 (1, 'Morris Plains, NJ')]

In [8]:
%sql SELECT count(distinct song_id) songs_registered, name as artist_name FROM dim_songs s JOIN dim_artists a ON s.artist_id = a.artist_id GROUP BY a.artist_id ORDER BY 1 DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(2, 'Clp'),
 (2, 'Casual'),
 (1, 'Billie Jo Spears'),
 (1, 'Tweeterfriendly Music'),
 (1, 'Danilo Perez')]

In [6]:
%sql SELECT * FROM dim_artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', nan, nan)]

In [7]:
%sql SELECT * FROM dim_time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 22, 0, 3, 52, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.datetime(2018, 11, 22, 0, 9, 10, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.datetime(2018, 11, 22, 0, 12, 6, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.datetime(2018, 11, 22, 0, 15, 41, 796000), 0, 22, 47, 11, 2018, 3),
 (datetime.datetime(2018, 11, 22, 0, 23, 40, 796000), 0, 22, 47, 11, 2018, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).